In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [2]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import pandas as pd
list = [4,8,15,16,23,42,14,15,16,18]
series = pd.Series(list)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
6    14
7    15
8    16
9    18
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [8]:
import pandas as pd
data = pd.DataFrame({'name':['Alice','Bob','pradeep'],
                     'Age':[25,30,27],
                     'Gender':['female','male','female']})

In [9]:
data

      name  Age  Gender
0    Alice   25  female
1      Bob   30    male
2  pradeep   27  female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
In pandas, a DataFrame is a 2-dimensional labeled data structure that represents tabular data, similar to a spreadsheet or a SQL table. 
It consists of rows and columns, where each column can contain different types of data (e.g., numeric, string, boolean) and has a unique label

called a column name. A DataFrame provides a convenient way to store, manipulate, and analyze structured data.

a Series is a one-dimensional labeled array-like object in pandas. It represents a single column of data in a DataFrame. 
A Series is similar to a NumPy array but with additional functionalities and the ability to have custom row labels called an index. Each element
in a Series can have a different data type, and the elements are labeled with an index, allowing for efficient data access and alignment.

In [15]:
print('Dataframe: ')
import pandas as pd
data = pd.DataFrame({'name':['Alice','Bob','pradeep'],
                     'Age':[25,30,27],
                     'Gender':['female','male','female']})
data

Dataframe:

      name  Age  Gender
0    Alice   25  female
1      Bob   30    male
2  pradeep   27  female

In [17]:
print('Series: ')
age_of_student = [24,15,12,16]
series = pd.Series(age_of_student)
series

Series:

0    24
1    15
2    12
3    16
dtype: int64

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
df.head()
df.tail()
df.info
df.describe()
df.sort_values('column_name', ascending=False)  
df.groupby('column_name').mean()
df.groupby('column_name').std()

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
In pandas, both Series and DataFrame are mutable, meaning their values can be modified after creation. However, Panel objects are considered 
deprecated in recent versions of pandas and have been replaced by other data structures like MultiIndex and 3D arrays. Therefore, Panels are not 
considered as part of the core pandas data structures anymore.

To summarize:

Series: Mutable. You can modify the values of a Series by assigning new values to specific elements or using methods like loc or at to update
values based on labels or indices.

DataFrame: Mutable. You can modify DataFrame values by assigning new values to specific cells, adding or removing columns, or using methods like 
loc or at to update values based on labels or indices.

Panel: Deprecated. Panel objects were mutable in previous versions of pandas, but they are no longer actively used or recommended. It is better to 
use other data structures like MultiIndex or 3D arrays to handle similar scenarios.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example

In [26]:
import pandas as pd
name = pd.Series(['pradeep','yati','siwani','sanju'])
age = pd.Series([24,23,25,24])
city = pd.Series(['Kharagpur','Indore','Raipur','Bhind'])
data = {'Name':name,'Age':age,'City':city}
df = pd.DataFrame(data)
df

      Name  Age       City
0  pradeep   24  Kharagpur
1     yati   23     Indore
2   siwani   25     Raipur
3    sanju   24      Bhind